apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sdmmc.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_sdmmc.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_SDMMC_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_SDMMC_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include <soc/reg_base.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define ESP32S3_TXFIFO_DEPTH               32
#define ESP32S3_TXFIFO_WIDTH               4
#define ESP32S3_RXFIFO_DEPTH               32
#define ESP32S3_RXFIFO_WIDTH               4

/* MCI register offsets (with respect to the MCI base) **********************/

#define ESP32S3_SDMMC_CTRL_OFFSET          0x0000 /* Control register */
                                                  /* 0x04: Reserved */
#define ESP32S3_SDMMC_CLKDIV_OFFSET        0x0008 /* Clock-divider register */
#define ESP32S3_SDMMC_CLKSRC_OFFSET        0x000c /* Clock-source register */
#define ESP32S3_SDMMC_CLKENA_OFFSET        0x0010 /* Clock-enable register */
#define ESP32S3_SDMMC_TMOUT_OFFSET         0x0014 /* Time-out register */
#define ESP32S3_SDMMC_CTYPE_OFFSET         0x0018 /* Card-type register */
#define ESP32S3_SDMMC_BLKSIZ_OFFSET        0x001c /* Block-size register */
#define ESP32S3_SDMMC_BYTCNT_OFFSET        0x0020 /* Byte-count register */
#define ESP32S3_SDMMC_INTMASK_OFFSET       0x0024 /* Interrupt-mask register */
#define ESP32S3_SDMMC_CMDARG_OFFSET        0x0028 /* Command-argument register */
#define ESP32S3_SDMMC_CMD_OFFSET           0x002c /* Command register */
#define ESP32S3_SDMMC_RESP0_OFFSET         0x0030 /* Response-0 register */
#define ESP32S3_SDMMC_RESP1_OFFSET         0x0034 /* Response-1 register */
#define ESP32S3_SDMMC_RESP2_OFFSET         0x0038 /* Response-2 register */
#define ESP32S3_SDMMC_RESP3_OFFSET         0x003c /* Response-3 register */
#define ESP32S3_SDMMC_MINTSTS_OFFSET       0x0040 /* Masked interrupt-status register */
#define ESP32S3_SDMMC_RINTSTS_OFFSET       0x0044 /* Raw interrupt-status register */
#define ESP32S3_SDMMC_STATUS_OFFSET        0x0048 /* Status register */
#define ESP32S3_SDMMC_FIFOTH_OFFSET        0x004c /* FIFO threshold register */
#define ESP32S3_SDMMC_CDETECT_OFFSET       0x0050 /* Card-detect register value */
#define ESP32S3_SDMMC_WRTPRT_OFFSET        0x0054 /* Write-protect register */
                                                  /* 0x58: Reserved */
#define ESP32S3_SDMMC_TCBCNT_OFFSET        0x005c /* Transferred CIU card byte count */
#define ESP32S3_SDMMC_TBBCNT_OFFSET        0x0060 /* Transferred cpu/DMA to/from BIU-FIFO byte count */
#define ESP32S3_SDMMC_DEBNCE_OFFSET        0x0064 /* Debounce count register */
                                                  /* 0x0068-0x0074: Reserved */
#define ESP32S3_SDMMC_RSTN_OFFSET          0x0078 /* Hardware Reset */
#define ESP32S3_SDMMC_BMOD_OFFSET          0x0080 /* Bus Mode Register */
#define ESP32S3_SDMMC_PLDMND_OFFSET        0x0084 /* Poll Demand Register */
#define ESP32S3_SDMMC_DBADDR_OFFSET        0x0088 /* Descriptor List Base Address Register */
#define ESP32S3_SDMMC_IDSTS_OFFSET         0x008c /* Internal DMAC Status Register */
#define ESP32S3_SDMMC_IDINTEN_OFFSET       0x0090 /* Internal DMAC Interrupt Enable Register */
#define ESP32S3_SDMMC_DSCADDR_OFFSET       0x0094 /* Current Host Descriptor Address Register */
#define ESP32S3_SDMMC_BUFADDR_OFFSET       0x0098 /* Current Buffer Descriptor Address Register */
                                                  /* 0x009c-0x00ff: Reserved */
#define ESP32S3_SDMMC_DATA_OFFSET          0x0200 /* Data FIFO read/write (>=) */
#define ESP32S3_SDMMC_CLOCK_OFFSET         0x0800

/* MCI register (virtual) addresses *****************************************/

#define ESP32S3_SDMMC_CTRL                 (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CTRL_OFFSET)
#define ESP32S3_SDMMC_PWREN                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_PWREN_OFFSET)
#define ESP32S3_SDMMC_CLKDIV               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CLKDIV_OFFSET)
#define ESP32S3_SDMMC_CLKSRC               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CLKSRC_OFFSET)
#define ESP32S3_SDMMC_CLKENA               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CLKENA_OFFSET)
#define ESP32S3_SDMMC_TMOUT                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_TMOUT_OFFSET)
#define ESP32S3_SDMMC_CTYPE                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CTYPE_OFFSET)
#define ESP32S3_SDMMC_BLKSIZ               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_BLKSIZ_OFFSET)
#define ESP32S3_SDMMC_BYTCNT               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_BYTCNT_OFFSET)
#define ESP32S3_SDMMC_INTMASK              (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_INTMASK_OFFSET)
#define ESP32S3_SDMMC_CMDARG               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CMDARG_OFFSET)
#define ESP32S3_SDMMC_CMD                  (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CMD_OFFSET)
#define ESP32S3_SDMMC_RESP0                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_RESP0_OFFSET)
#define ESP32S3_SDMMC_RESP1                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_RESP1_OFFSET)
#define ESP32S3_SDMMC_RESP2                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_RESP2_OFFSET)
#define ESP32S3_SDMMC_RESP3                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_RESP3_OFFSET)
#define ESP32S3_SDMMC_MINTSTS              (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_MINTSTS_OFFSET)
#define ESP32S3_SDMMC_RINTSTS              (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_RINTSTS_OFFSET)
#define ESP32S3_SDMMC_STATUS               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_STATUS_OFFSET)
#define ESP32S3_SDMMC_FIFOTH               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_FIFOTH_OFFSET)
#define ESP32S3_SDMMC_CDETECT              (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CDETECT_OFFSET)
#define ESP32S3_SDMMC_WRTPRT               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_WRTPRT_OFFSET)
#define ESP32S3_SDMMC_TCBCNT               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_TCBCNT_OFFSET)
#define ESP32S3_SDMMC_TBBCNT               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_TBBCNT_OFFSET)
#define ESP32S3_SDMMC_DEBNCE               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_DEBNCE_OFFSET)
#define ESP32S3_SDMMC_RSTN                 (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_RSTN_OFFSET)
#define ESP32S3_SDMMC_BMOD                 (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_BMOD_OFFSET)
#define ESP32S3_SDMMC_PLDMND               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_PLDMND_OFFSET)
#define ESP32S3_SDMMC_DBADDR               (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_DBADDR_OFFSET)
#define ESP32S3_SDMMC_IDSTS                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_IDSTS_OFFSET)
#define ESP32S3_SDMMC_IDINTEN              (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_IDINTEN_OFFSET)
#define ESP32S3_SDMMC_DSCADDR              (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_DSCADDR_OFFSET)
#define ESP32S3_SDMMC_BUFADDR              (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_BUFADDR_OFFSET)
#define ESP32S3_SDMMC_DATA                 (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_DATA_OFFSET)
#define ESP32S3_SDMMC_CLOCK                (DR_REG_SDMMC_BASE+ESP32S3_SDMMC_CLOCK_OFFSET)

