apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_sdmmc.h
/* Write protect register WRTPRT */

#define SDMMC_WRTPRT_PROTECTED(slot)     (1 << (slot))  /* Bit 0: Write protect */
                                                        /* Bit 1-31: Reserved */

/* Debounce count register */

#define SDMMC_DEBNCE_MASK                 0x00ffffff /* Bits 0-23: Debounce count */
                                                     /* Bit 24-31: Reserved */

/* Hardware Reset */

#define SDMMC_RSTN                        (1 << 0)  /* Bit 0: Hardware reset */
                                                    /* Bit 1-31: Reserved */

/* Bus Mode Register */

#define SDMMC_BMOD_SWR                    (1 << 0)  /* Bit 0:  Software Reset */
#define SDMMC_BMOD_FB                     (1 << 1)  /* Bit 1:  Fixed Burst */
#define SDMMC_BMOD_DSL_SHIFT              (2)       /* Bits 2-6: Descriptor Skip Length */
#define SDMMC_BMOD_DSL_MASK               (31 << SDMMC_BMOD_DSL_SHIFT)
#define SDMMC_BMOD_DSL(n)                 ((uint32_t)(n) << SDMMC_BMOD_DSL_SHIFT)
#define SDMMC_BMOD_DE                     (1 << 7)  /* Bit 7:  SD/MMC DMA Enable */
#define SDMMC_BMOD_PBL_SHIFT              (8)       /* Bits 8-10: Programmable Burst Length */
#define SDMMC_BMOD_PBL_MASK               (7 << SDMMC_BMOD_PBL_SHIFT)
#define SDMMC_BMOD_PBL_1XFRS              (0 << SDMMC_BMOD_PBL_SHIFT) /* 1 transfer */
#define SDMMC_BMOD_PBL_4XFRS              (1 << SDMMC_BMOD_PBL_SHIFT) /* 4 transfers */
#define SDMMC_BMOD_PBL_8XFRS              (2 << SDMMC_BMOD_PBL_SHIFT) /* 8 transfers */
#define SDMMC_BMOD_PBL_16XFRS             (3 << SDMMC_BMOD_PBL_SHIFT) /* 16 transfers */
#define SDMMC_BMOD_PBL_32XFRS             (4 << SDMMC_BMOD_PBL_SHIFT) /* 32 transfers */
#define SDMMC_BMOD_PBL_64XFRS             (5 << SDMMC_BMOD_PBL_SHIFT) /* 64 transfers */
#define SDMMC_BMOD_PBL_128XFRS            (6 << SDMMC_BMOD_PBL_SHIFT) /* 128 transfers */
#define SDMMC_BMOD_PBL_256XFRS            (7 << SDMMC_BMOD_PBL_SHIFT) /* 256 transfers */

                                                    /* Bits 11-31: Reserved */

/* Internal DMAC Status Register */

#define SDMMC_IDSTS_TI                    (1 << 0)  /* Bit 0:  Transmit Interrupt */
#define SDMMC_IDSTS_RI                    (1 << 1)  /* Bit 1:  Receive Interrupt */
#define SDMMC_IDSTS_FBE                   (1 << 2)  /* Bit 2:  Fatal Bus Error Interrupt */
                                                    /* Bit 3:  Reserved */
#define SDMMC_IDSTS_DU                    (1 << 4)  /* Bit 4:  Descriptor Unavailable Interrupt */
#define SDMMC_IDSTS_CES                   (1 << 5)  /* Bit 5:  Card Error Summary */
                                                    /* Bits 6-7: Reserved */
#define SDMMC_IDSTS_NIS                   (1 << 8)  /* Bit 8:  Normal Interrupt Summary */
#define SDMMC_IDSTS_AIS                   (1 << 9)  /* Bit 9:  Abnormal Interrupt Summary */
#define SDMMC_IDSTS_EB_SHIFT              (10)      /* Bits 10-12: Error Bits */
#define SDMMC_IDSTS_EB_MASK               (7 << SDMMC_IDSTS_EB_SHIFT)
#define SDMMC_IDSTS_EB_TXHABORT           (1 << SDMMC_IDSTS_EB_SHIFT) /* Host Abort received during transmission */
#define SDMMC_IDSTS_EB_RXHABORT           (2 << SDMMC_IDSTS_EB_SHIFT) /* Host Abort received during reception */

#define SDMMC_IDSTS_FSM_SHIFT             (13)      /* Bits 13-16: DMAC state machine present state */
#define SDMMC_IDSTS_FSM_MASK              (15 << SDMMC_IDSTS_FSM_SHIFT)
#define SDMMC_IDSTS_FSM_DMAIDLE           (0 << SDMMC_IDSTS_FSM_SHIFT) /* DMA_IDLE*/
#define SDMMC_IDSTS_FSM_DMASUSP           (1 << SDMMC_IDSTS_FSM_SHIFT) /* DMA_SUSPEND */
#define SDMMC_IDSTS_FSM_DESCRD            (2 << SDMMC_IDSTS_FSM_SHIFT) /* DESC_RD */
#define SDMMC_IDSTS_FSM_DESCCHK           (3 << SDMMC_IDSTS_FSM_SHIFT) /* DESC_CHK */
#define SDMMC_IDSTS_FSM_DMARDREQW         (4 << SDMMC_IDSTS_FSM_SHIFT) /* DMA_RD_REQ_WAIT */
#define SDMMC_IDSTS_FSM_DMAWRREQW         (5 << SDMMC_IDSTS_FSM_SHIFT) /* DMA_WR_REQ_WAIT */
#define SDMMC_IDSTS_FSM_DMARD             (6 << SDMMC_IDSTS_FSM_SHIFT) /* DMA_RD */
#define SDMMC_IDSTS_FSM_DMAWR             (7 << SDMMC_IDSTS_FSM_SHIFT) /* DMA_WR */
#define SDMMC_IDSTS_FSM_DMACLOSE          (8 << SDMMC_IDSTS_FSM_SHIFT) /* DESC_CLOSE */

                                                    /* Bits 17-31: Reserved */

/* Internal DMAC Interrupt Enable Register */

#define SDMMC_IDINTEN_TI                  (1 << 0)  /* Bit 0:  Transmit Interrupt */
#define SDMMC_IDINTEN_RI                  (1 << 1)  /* Bit 1:  Receive Interrupt */
#define SDMMC_IDINTEN_FBE                 (1 << 2)  /* Bit 2:  Fatal Bus Error Interrupt */
                                                    /* Bit 3:  Reserved */
#define SDMMC_IDINTEN_DU                  (1 << 4)  /* Bit 4:  Descriptor Unavailable Interrupt */
#define SDMMC_IDINTEN_CES                 (1 << 5)  /* Bit 5:  Card Error Summary */
                                                    /* Bits 6-7: Reserved */
#define SDMMC_IDINTEN_NIS                 (1 << 8)  /* Bit 8:  Normal Interrupt Summary */
#define SDMMC_IDINTEN_AIS                 (1 << 9)  /* Bit 9:  Abnormal Interrupt Summary */
                                                    /* Bits 10-31: Reserved */
#define SDMMC_IDINTEN_ALL                 0x00000333

#define SDMMC_CLOCK_PHASE_DOUT_SHIFT      (0)
#define SDMMC_CLOCK_PHASE_MASK            (0x1FF << SDMMC_CLOCK_PHASE_DOUT_SHIFT)
#define SDMMC_CLOCK_PHASE_DOUT_MASK       (0x7 << SDMMC_CLOCK_PHASE_DOUT_SHIFT)
#define SDMMC_CLOCK_PHASE_DIN_SHIFT       (3)
#define SDMMC_CLOCK_PHASE_DIN_MASK        (0x7 << SDMMC_CLOCK_PHASE_DIN_SHIFT)
#define SDMMC_CLOCK_PHASE_CORE_SHIFT      (6)
#define SDMMC_CLOCK_PHASE_CORE_MASK       (0x7 << SDMMC_CLOCK_PHASE_CORE_SHIFT)
#define SDMMC_CLOCK_DIV_FACTOR_H_SHIFT    (9)
#define SDMMC_CLOCK_DIV_FACTOR_MASK       (0xFFF << SDMMC_CLOCK_DIV_FACTOR_H_SHIFT)
#define SDMMC_CLOCK_DIV_FACTOR_H_MASK     (0xF << SDMMC_CLOCK_DIV_FACTOR_H_SHIFT)
#define SDMMC_CLOCK_DIV_FACTOR_L_SHIFT    (13)
#define SDMMC_CLOCK_DIV_FACTOR_L_MASK     (0xF << SDMMC_CLOCK_DIV_FACTOR_L_SHIFT)
#define SDMMC_CLOCK_DIV_FACTOR_N_SHIFT    (17)
#define SDMMC_CLOCK_DIV_FACTOR_N_MASK     (0xF << SDMMC_CLOCK_DIV_FACTOR_N_SHIFT)
#define SDMMC_CLOCK_CLK_SEL_SHIFT         (23)
#define SDMMC_CLOCK_CLK_SEL_MASK          (1 << SDMMC_CLOCK_CLK_SEL_SHIFT)
#define SDMMC_CLOCK_CLK_SEL_PLL160M       (1 << SDMMC_CLOCK_CLK_SEL_SHIFT)
#define SDMMC_CLOCK_CLK_SEL_XTAL          (0 << SDMMC_CLOCK_CLK_SEL_SHIFT)

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_SDMMC_H */
